20220729163811-shared_variables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-05 Fri 19:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shared variables</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Shared variables</h1>
<p>
The documentation defines shared variables as variables that "may be shared between different functions". Well it turns out they have a much deeper meaning that was not explicited in <code>Aesara</code>, and was not made obvious by this name. Let's explore what <code>shared</code> variables are, what they can be used for, where they occur in the library and where they make things difficult.
</p>

<p>
Example taken from <a target='_blank' rel='noopener noreferrer' class='external' href="https://aesara.readthedocs.io/en/latest/tutorial/examples.html?highlight=shared#using-shared-variables">the documentation</a>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara <span style="font-weight: bold;">import</span> function, shared
<span style="font-weight: bold;">import</span> aesara.tensor <span style="font-weight: bold;">as</span> at

<span style="font-weight: bold; font-style: italic;">state</span> = shared(0)
<span style="font-weight: bold; font-style: italic;">inc</span> = at.iscalar(<span style="font-style: italic;">'inc'</span>)
<span style="font-weight: bold; font-style: italic;">accumulate</span> = function([inc], state, updates=[(state, state+inc)])

<span style="font-weight: bold;">print</span>(state.get_value())
accumulate(1)
<span style="font-weight: bold;">print</span>(state.get_value())
accumulate(10)
<span style="font-weight: bold;">print</span>(state.get_value())
state.set_value(0)
<span style="font-weight: bold;">print</span>(state.get_value())

<span style="font-weight: bold; font-style: italic;">decrement</span> = function([inc], state, updates=[(state, state-inc)])

decrement(1)
<span style="font-weight: bold;">print</span>(state.get_value())
</pre>
</div>

<p>
<code>shared</code> variables are not completely symbolic as they carry some internal state. They interact with the graph in two ways:
</p>
<ol class="org-ol">
<li><code>get_value</code> gets the current value of the variable, stored in a container.</li>
<li><code>set_value</code> sets the value of the shared variable for <i>all</i> the functions it is used in.</li>
</ol>

<p>
They also allow sharing state between compiled graphs.
</p>

<p>
<code>updates</code> parameter in <code>function</code> tells the compiler that when the function is going to be run the value of the shared variable is going to be modified in X way. They are necessary because the value of the shared variables needs to be propagated globally?
</p>

<div id="outline-container-org9d99812" class="outline-3">
<h3 id="org9d99812"><span class="todo TODO">TODO</span> Conceptual understanding: what is a shared variable? Why is it not a Variable?</h3>
<div class="outline-text-3" id="text-org9d99812">
<p>
<b>Variables are placeholders, mere step in a computation. They are variables in the mathematical sense. Shared variables are variables in the computing sense: a value store.</b> The problem is that shared variables introduce a notion of <a href="20220729171741-control_flow_in_aesara.html#ID-8d8344ab-49e9-480d-b1d6-1336dbf60f9f">imperative programming</a> (namely "update this register in memory with this value"). Shared variables allow us to:
</p>
<ul class="org-ul">
<li>Interact with our graphs once they've been computed;</li>
<li>Link different compiled graphs;</li>
<li>SOmething with <code>scan</code>.</li>
</ul>

<p>
We can read the following <code>aesara.function</code>'s docstring:
</p>

<blockquote>
<ol class="org-ol">
<li>RemoveShared: shared variables are just an abstraction to make</li>
</ol>
<p>
things more convenient for the user. The shared variables are
transformed into implicit inputs and implicit outputs. The
optimizations don't see which variables are shared or not.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org9aa4129" class="outline-3">
<h3 id="org9aa4129"><span class="todo TODO">TODO</span> How does <code>scan</code> work with updates?</h3>
<div class="outline-text-3" id="text-org9aa4129">
<p>
Well, <code>scan</code> returns a graph that says how the shared variable within should be treated.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> aesara

<span style="font-weight: bold; font-style: italic;">a</span> = aesara.shared(1)
<span style="font-weight: bold; font-style: italic;">values</span>, <span style="font-weight: bold; font-style: italic;">updates</span> = aesara.scan(<span style="font-weight: bold;">lambda</span>: {a: a+1}, n_steps=10)
aesara.dprint(updates[a])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">b</span> = a + 1
<span style="font-weight: bold; font-style: italic;">c</span> = updates[a] + 1
<span style="font-weight: bold; font-style: italic;">f</span> = aesara.function([], [b, c], updates=updates)
</pre>
</div>

<p>
It has an interesting behavior. If we run the function we get something expected:
</p>

<div class="org-src-container">
<pre class="src src-python">f()
</pre>
</div>

<p>
<code>b</code> is the original value, plus one. <code>c</code> includes the increments that we built by <code>scan</code>. If we run the function again we see that <code>a</code> value was incremented by 10:
</p>

<div class="org-src-container">
<pre class="src src-python">f()
</pre>
</div>

<p>
What if we don't pass the <code>updates</code> to the function?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> aesara <span style="font-weight: bold;">import</span> function, shared

<span style="font-weight: bold; font-style: italic;">a</span> = shared(1)
<span style="font-weight: bold; font-style: italic;">values</span>, <span style="font-weight: bold; font-style: italic;">updates</span> = aesara.scan(<span style="font-weight: bold;">lambda</span>: {a: a+1}, n_steps=10)
<span style="font-weight: bold; font-style: italic;">b</span> = a + 1
<span style="font-weight: bold; font-style: italic;">c</span> = updates[a] + 1
<span style="font-weight: bold; font-style: italic;">f</span> = aesara.function([], [b, c])
<span style="font-weight: bold;">print</span>(f())
<span style="font-weight: bold;">print</span>(f())
</pre>
</div>

<p>
The updates were not <i>applied</i> to the shared variable. What passing the updates to the function means is "also update the shared variables' value". Does it otherwise? Let's take a simple example:
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="font-weight: bold; font-style: italic;">a</span> = shared(0)
<span style="font-weight: bold; font-style: italic;">a</span> = a + 1
<span style="font-weight: bold; font-style: italic;">fn</span> = aesara.function([], a)
<span style="font-weight: bold;">print</span>(fn())
<span style="font-weight: bold;">print</span>(fn())
aesara.dprint(a)
</pre>
</div>

<p>
So <code>Variables</code> are placeholders, they're not variables in the sense of the host language (python) as they don't store any value. <code>SharedVariables</code> however <i>are</i> variables in the sense of the host language; we can modify them in the host process runtime, or in the <i>graph</i> runtime using the <code>updates</code> kwarg in the function.
</p>
</div>
</div>

<div id="outline-container-orgc313d2d" class="outline-3">
<h3 id="orgc313d2d"><span class="todo TODO">TODO</span> What happens to shared variables when the graph is copied?</h3>
<div class="outline-text-3" id="text-orgc313d2d">
<p>
If the updates still refer to the original shared variables then nothing is going to happen; so using <code>aesara.graph.basic.clone_get_equiv</code> and passing the origin updates will likely lead to buggy code since the original updates won't be applied to the cloned variable.
</p>

<p>
Instead we need to use functions like <code>aesara.compile.function.pfunc.rebuild_collec_shared</code> to also get the updated updates.
</p>
</div>
</div>

<div id="outline-container-org0a9ee39" class="outline-3">
<h3 id="org0a9ee39"><span class="todo TODO">TODO</span> Why do we use <code>shared</code> variables for the <code>RandomStream</code>?</h3>
</div>

<div id="outline-container-org3ff4d0e" class="outline-2">
<h2 id="org3ff4d0e">References</h2>
<div class="outline-text-2" id="text-org3ff4d0e">
<ul class="org-ul">
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://aesara.readthedocs.io/en/latest/library/compile/shared.html?highlight=shared#module-aesara.compile.sharedvalue"><code>shared</code> in the Aesara documentation</a></li>
<li><a target='_blank' rel='noopener noreferrer' class='external' href="https://github.com/aesara-devs/aesara/blob/8763981ca4263e153c68e6be39c03a272c027b60/aesara/compile/sharedvalue.py#L34-L221">Implementation on github</a></li>
</ul>
</div>
</div>

<div id="outline-container-org022eeca" class="outline-2">
<h2 id="org022eeca">Links to this note</h2>
<div class="outline-text-2" id="text-org022eeca">
<ul class="org-ul">
<li><a href="./20220729163627-aesara.html">Aesara</a></li>
<li><a href="./20220729171741-control_flow_in_aesara.html">imperative concepts in Aesara</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
